app/controllers/administrative_regions_controller.rb

  def index
    @administrative_regions = AdministrativeRegion.all
---
SELECT `administrative_regions`.* FROM `administrative_regions`

  def create
    @administrative_region = AdministrativeRegion.new(administrative_region_params)

    respond_to do |format|
      if @administrative_region.save
---
INSERT INTO `administrative_regions` (`name`, `initials`, `created_at`, `updated_at`) VALUES ('Teste', 'AB', '2015-08-07 03:00:36.522193', '2015-08-07 03:00:36.522193')

    def set_administrative_region
      @administrative_region = AdministrativeRegion.find(params[:id])
---
SELECT  `administrative_regions`.* FROM `administrative_regions` WHERE `administrative_regions`.`id` = 1 LIMIT 1