app/controllers/bonds_controller.rb

  def index
    @bonds = Bond.all
---
SELECT `bonds`.* FROM `bonds`

  def create
    @bond = Bond.new(bond_params)

    respond_to do |format|
      if @bond.save
---
INSERT INTO `bonds` (`description`, `obs`, `dt_admission`, `created_at`, `updated_at`) VALUES ('', '', '2015-08-04', '2015-08-04 03:00:25.167125', '2015-08-04 03:00:25.167125')

    def set_bond
      @bond = Bond.find(params[:id])
---
SELECT  `bonds`.* FROM `bonds` WHERE `bonds`.`id` = 1 LIMIT 1