app/controllers/districts_controller.rb

SELECT `districts`.* FROM `districts`
---
  def index
    @districts = District.all

INSERT INTO `districts` (`name`, `created_at`, `updated_at`) VALUES ('', '2015-08-04 03:09:48.008355', '2015-08-04 03:09:48.008355')
---
  def create
    @district = District.new(district_params)

    respond_to do |format|
      if @district.save

SELECT  `districts`.* FROM `districts` WHERE `districts`.`id` = 1 LIMIT 1
---
    def set_district
      @district = District.find(params[:id])