app/controllers/frequencies_controller.rb

  def index
    session.delete(:id_user)
    @frequencies = Frequency.all
---
SELECT `frequencies`.* FROM `frequencies`

  def create
    @frequency = Frequency.new(frequency_params)

    respond_to do |format|
      if @frequency.save
---
INSERT INTO `frequencies` (`person_id`, `frequency_date`, `time_input`, `time_output`, `created_at`, `updated_at`) VALUES (1, '2015-11-23', '2015-11-23 06:55:00.000000', '2015-11-23 14:28:00.000000', '2015-11-24 01:30:49.235766', '2015-11-24 01:30:49.235766')

  def update
    respond_to do |format|
      if @frequency.update(frequency_params)
---
UPDATE `frequencies` SET `time_output` = '2000-01-01 01:29:00.000000', `updated_at` = '2015-11-25 03:51:41.465828' WHERE `frequencies`.`id` = 4

  def destroy
    @frequency.destroy
---
DELETE FROM `frequencies` WHERE `frequencies`.`id` = 1

    def set_frequency
      @frequency = Frequency.find(params[:id])
---
SELECT  `frequencies`.* FROM `frequencies` WHERE `frequencies`.`id` = 4 LIMIT 1

    def set_frequencies_for_person
      @frequencies = Frequency.where(person_id: params[:id])
---
SELECT `frequencies`.* FROM `frequencies` WHERE `frequencies`.`person_id` IN (1, 2)

    def set_frequencies_for_cpf
      @person = Person.where(cpf: params[:cpf]).first
      if params[:cpf] == '0'
        @frequencies = Frequency.all
---
SELECT `frequencies`.* FROM `frequencies`