app/controllers/functions_controller.rb

SELECT `functions`.* FROM `functions`
---
  def index
    @functions = Function.all

INSERT INTO `functions` (`name`, `created_at`, `updated_at`) VALUES ('', '2015-08-04 03:13:27.746459', '2015-08-04 03:13:27.746459')
---
  def create
    @function = Function.new(function_params)

    respond_to do |format|
      if @function.save

SELECT  `functions`.* FROM `functions` WHERE `functions`.`id` = 1 LIMIT 1
---
    def set_function
      @function = Function.find(params[:id])