app/controllers/instituations_controller.rb

SELECT `instituations`.* FROM `instituations`
---
  def index
    @instituations = Instituation.all

INSERT INTO `instituations` (`name`, `created_at`, `updated_at`) VALUES ('', '2015-08-04 03:24:05.823912', '2015-08-04 03:24:05.823912')
---
  def create
    @instituation = Instituation.new(instituation_params)

    respond_to do |format|
      if @instituation.save

SELECT  `instituations`.* FROM `instituations` WHERE `instituations`.`id` = 1 LIMIT 1
---
    def set_instituation
      @instituation = Instituation.find(params[:id])