app/controllers/locals_controller.rb

  def index
    @locals = Local.all
---
SELECT `locals`.* FROM `locals`

  def new
    @local = Local.new
    @type_locals = TypeLocal.all
---
SELECT  `type_locals`.* FROM `type_locals`  ORDER BY `type_locals`.`id` ASC LIMIT 1

  def create
    @local = Local.new(local_params)

    respond_to do |format|
      if @local.save
---
INSERT INTO `locals` (`name`, `name_abr`, `initials`, `tel1`, `tel2`, `tel3`, `created_at`, `updated_at`) VALUES ('', '', '', '', '', '', '2015-08-04 03:27:58.359879', '2015-08-04 03:27:58.359879')

    def set_local
      @local = Local.find(params[:id])
---
SELECT  `locals`.* FROM `locals` WHERE `locals`.`id` = 1 LIMIT 1