app/controllers/people_controller.rb

  def new
    @person = Person.new
    @districts = District.all
---
SELECT `districts`.* FROM `districts`