app/controllers/stockings_controller.rb

  def index
    @stockings = Stocking.all
---
SELECT `stockings`.* FROM `stockings`