app/controllers/type_locals_controller.rb

  def index
    @type_locals = TypeLocal.all
---
SELECT `type_locals`.* FROM `type_locals`