app/controllers/type_bonds_controller.rb

SELECT `type_bonds`.* FROM `type_bonds`
---
  def index
    @type_bonds = TypeBond.all

INSERT INTO `type_bonds` (`name`, `abbreviation`, `created_at`, `updated_at`) VALUES ('', '', '2015-08-04 04:28:27.044726', '2015-08-04 04:28:27.044726')
---
  def create
    @type_bond = TypeBond.new(type_bond_params)

    respond_to do |format|
      if @type_bond.save

SELECT  `type_bonds`.* FROM `type_bonds` WHERE `type_bonds`.`id` = 1 LIMIT 1
---
    def set_type_bond
      @type_bond = TypeBond.find(params[:id])