app/controllers/type_patios_controller.rb

  def index
    @type_patios = TypePatio.all
---
SELECT `type_patios`.* FROM `type_patios`

  def create
    @type_patio = TypePatio.new(type_patio_params)

    respond_to do |format|
      if @type_patio.save
---
INSERT INTO `type_patios` (`name`, `initial`, `created_at`, `updated_at`) VALUES ('', '', '2015-08-04 04:32:45.046936', '2015-08-04 04:32:45.046936')

    def set_type_patio
      @type_patio = TypePatio.find(params[:id])
---
SELECT  `type_patios`.* FROM `type_patios` WHERE `type_patios`.`id` = 1 LIMIT 1