app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('ricardo@ricardo.com', '$2a$10$vI/gKjixs38XoknDyt3.MO39kxPpsU4cIWfO11xo./Yoe8ao2VH06', '2015-08-10 02:04:19.770233', '2015-08-10 02:04:19.770233')