app/views/bonds/_form.html.erb

        <%= f.label 'tipo de vínculo'%><br>
        <%= collection_select(:type_bond, :type_bond_id, TypeBond.all, :id, :name, prompt: true) %>
---
SELECT `type_bonds`.* FROM `type_bonds`

        <%= f.label 'instituição' %><br>
        <%= collection_select(:instituation, :instituation_id, Instituation.all, :id, :name, prompt: true) %>
---
SELECT `instituations`.* FROM `instituations`